memovai/mimimodel/needle-esp32s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16MB quad flash, QIO 80MHz
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# 8MB octal PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304
CONFIG_SPIRAM_MEMTEST=n

# CPU 240MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# perf build
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# custom partition table with 13.9MB weights partition
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# inference runs for minutes in main task: big stack, no task watchdog
CONFIG_ESP_MAIN_TASK_STACK_SIZE=49152
CONFIG_ESP_TASK_WDT_INIT=n

# larger cache helps streaming 13.7MB of weights per token from flash
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# Console. printf/stdin only ever reach the PRIMARY console (a secondary one
# mirrors ESP_LOG but not stdio), so this has to match the board:
#   native-USB boards  -> CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
#   USB-UART bridge    -> CONFIG_ESP_CONSOLE_UART_DEFAULT=y   (this default)
# `esptool flash_id` prints "USB mode: USB-Serial/JTAG" on the former only.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
